In [1]:
import pandas as pd

In [2]:
dic = {'Nome': ['Lucian', 'Mariana', 'Pamela', 'Ana Luisa', 'Jessica', 'Jo達o', 'Maria'],
       'Idade': [31, 5, 27, 3, 18, 14, 10]}
dic

{'Nome': ['Lucian',
  'Mariana',
  'Pamela',
  'Ana Luisa',
  'Jessica',
  'Jo達o',
  'Maria'],
 'Idade': [31, 5, 27, 3, 18, 14, 10]}

In [3]:
dic2 = {'Nome': ['Lucian', 'Pamela', 'Ana Luisa', 'Paula', 'Ricardo', 'beleuza'],
       'Idade': [31, 27, 3, 16, 12, 9]}
dic2

{'Nome': ['Lucian', 'Pamela', 'Ana Luisa', 'Paula', 'Ricardo', 'beleuza'],
 'Idade': [31, 27, 3, 16, 12, 9]}

In [4]:
df = pd.DataFrame(dic, columns=['Nome', 'Idade'])
df

        Nome  Idade
0     Lucian     31
1    Mariana      5
2     Pamela     27
3  Ana Luisa      3
4    Jessica     18
5       Jo達o     14
6      Maria     10

In [5]:
df2 = pd.DataFrame(dic2, columns=['Nome', 'Idade'])
df2

        Nome  Idade
0     Lucian     31
1     Pamela     27
2  Ana Luisa      3
3      Paula     16
4    Ricardo     12
5    beleuza      9

In [6]:
df2.loc[0, 'Nome']

'Lucian'